'''

    얕은 복사(주소값 복사) 및 깊은 복사(실제값 복사) 개념

    1. 파이썬

    2. numpy

'''
import numpy as np

#1. 파이썬
#가. 얕은 복사(주소값 복사)
x= [1,2,3,[4,5,6]]
x2 = x
print(id(x),id(x2)) #4348467712 4348467712
x[0] = 100
print(x,x2) #[100, 2, 3, [4, 5, 6]] [100, 2, 3, [4, 5, 6]]
x[3][0] = 400
print(x,x2) #[100, 2, 3, [400, 5, 6]] [100, 2, 3, [400, 5, 6]]
print('*'*100)
#나. 깊은 복사(실제값 복사)
#슬라이싱으로 복사하면 바깥만 깊은 복사가 된다 나머지는 얕은 복사
#바깥쪽 리스트는 깊은 복사되고 중첩된 리스트는 얕은 복사된다.
x= [1,2,3,[4,5,6]]
x2 = x[:]
print(id(x),id(x2)) #4415989312 4416096512
x[0] = 100
print(x,x2) #[100, 2, 3, [4, 5, 6]] [1, 2, 3, [4, 5, 6]]
x[3][0] = 400
print(x,x2) #[100, 2, 3, [400, 5, 6]] [1, 2, 3, [400, 5, 6]]
print('*'*100)
#바깥쪽 리스트는 깊은 복사되고 중첩된 리스트도 깊은 복사되도록 copy.deepcopy() 를 사용한다
import copy
x= [1,2,3,[4,5,6]]
x2 = x[:]
x3 = copy.deepcopy(x)
print(id(x),id(x2),id(x3)) #4370293760 4370293888 4370400640
x[0] = 100
print(x,x2,x3) #[100, 2, 3, [4, 5, 6]] [1, 2, 3, [4, 5, 6]] [1, 2, 3, [4, 5, 6]]
x[3][0] = 400
print(x,x2,x3) #[100, 2, 3, [400, 5, 6]] [1, 2, 3, [400, 5, 6]] [1, 2, 3, [4, 5, 6]]
print('*'*100)

#2. numpy
arr = np.arange(9).reshape(3,3)
print(arr)
'''
[[0 1 2]
 [3 4 5]
 [6 7 8]]
'''
arr2 = arr[:]
arr[0]=100
print(arr,arr2)
'''
둘다 
[[100 100 100]
 [  3   4   5]
 [  6   7   8]] 
'''
import copy
arr = np.arange(9).reshape(3,3)
arr2 = copy.deepcopy(arr)
arr[0]=100
print(arr,arr2)
'''
arr:
[[100 100 100]
 [  3   4   5]
 [  6   7   8]] 

arr2:
 [[0 1 2]
 [3 4 5]
 [6 7 8]]
 '''